EasyDP/build/classes/resources/XML/uploadFile.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="SOATest">
      <dp:set-file name="local:/dir1/dir2/dir3/Logs.xml">PGw6ZXZlbnQgZGF0ZVRpbWU9IjIwMTUtMDktMDMgMDY6MjM6MjUuNzU4IiBsYXllck5hbWU9Ik9T&#13;
QiIgcHJvY2Vzc05hbWU9Ik1hbmFnZUFkZE9uXzFfMC5nZXRDdXJyZW50QWRkT25zVXNhZ2VfMSIg&#13;
ZXZlbnRUeXBlPSJCRUdJTiIgZXZlbnRTdGF0dXM9IiIgZXZlbnRDb2RlPSIiIG91dGJvdW5kU2Vy&#13;
dmljZU5hbWU9IiIgc2VydmVySG9zdElQPSJpZW8yd2x6c29hdDAyLzEwLjE0Mi40LjExL3NvYV9z&#13;
ZXJ2ZXIyIiBhcHBsaWNhdGlvbklEPSJ1c3NkIiBwcm92aWRlcklEPSJvMmllIiBvcmlnaW5hdG9y&#13;
SVA9IjYyLjQwLjM4LjQxIiBTT0FDb25zdW1lclRyYW5zYWN0aW9uSUQ9IiIgU09BVHJhbnNhY3Rp&#13;
b25JRD0iNmI4YTZiMDctMWViMC00NDI0LTliYjktZWE0N2ZhNGNiNzMzIj48Z2V0Q3VycmVudEFk&#13;
ZE9uc1VzYWdlXzEgeG1sbnM9Imh0dHA6Ly9zb2EubzIuaWUvbWFuYWdlYWRkb25kYXRhXzFfMCIg&#13;
eG1sbnM6c29hcGVudj0iaHR0cDovL3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8i&#13;
IHhtbG5zOnhzZD0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOnhzaT0i&#13;
aHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiPjxtc2lzZG4+MzUzODY3&#13;
ODc3NzI2PC9tc2lzZG4+PHN1YnNjcmliZXJUeXBlPlBSRVBBWTwvc3Vic2NyaWJlclR5cGU+PGFk&#13;
ZE9uQ2F0ZWdvcnk+REFUQTwvYWRkT25DYXRlZ29yeT48YWRkT25TdWJDYXRlZ29yeT5ET01NSURB&#13;
VEE8L2FkZE9uU3ViQ2F0ZWdvcnk+PGNoYW5uZWxJZGVudGlmaWVyPlVTU0Q8L2NoYW5uZWxJZGVu&#13;
dGlmaWVyPjwvZ2V0Q3VycmVudEFkZE9uc1VzYWdlXzE+PC9sOmV2ZW50Pg0KPGw6ZXZlbnQgZGF0&#13;
ZVRpbWU9IjIwMTUtMDktMDMgMDY6MjM6MjUuODI4IiBsYXllck5hbWU9Ik9TQiIgcHJvY2Vzc05h&#13;
bWU9Ik1hbmFnZUFkZE9uXzFfMC5nZXRDdXJyZW50QWRkT25zVXNhZ2VfMSIgZXZlbnRUeXBlPSJP&#13;
VVRCT1VORCIgZXZlbnRTdGF0dXM9IiIgZXZlbnRDb2RlPSIiIG91dGJvdW5kU2VydmljZU5hbWU9&#13;
Ik1hbmFnZUFkZE9uX0ludGVybWVkaWF0ZVByb3h5Lm51bGwiIHNlcnZlckhvc3RJUD0iaWVvMnds&#13;
enNvYXQwMi8xMC4xNDIuNC4xMS9zb2Ffc2VydmVyMiIgYXBwbGljYXRpb25JRD0idXNzZCIgcHJv&#13;
dmlkZXJJRD0ibzJpZSIgb3JpZ2luYXRvcklQPSI2Mi40MC4zOC40MSIgU09BQ29uc3VtZXJUcmFu&#13;
c2FjdGlvbklEPSIiIFNPQVRyYW5zYWN0aW9uSUQ9IjZiOGE2YjA3LTFlYjAtNDQyNC05YmI5LWVh&#13;
NDdmYTRjYjczMyI+PC9sOmV2ZW50Pg0KPGw6ZXZlbnQgZGF0ZVRpbWU9IjIwMTUtMDktMDMgMDY6&#13;
MjM6MjYuODgiIGxheWVyTmFtZT0iT1NCIiBwcm9jZXNzTmFtZT0iTWFuYWdlQWRkT25fMV8wLmdl&#13;
dEN1cnJlbnRBZGRPbnNVc2FnZV8xIiBldmVudFR5cGU9IklOQk9VTkQiIGV2ZW50U3RhdHVzPSJT&#13;
VUNDRVNTIiBldmVudENvZGU9IiIgb3V0Ym91bmRTZXJ2aWNlTmFtZT0iTWFuYWdlQWRkT25fSW50&#13;
ZXJtZWRpYXRlUHJveHkubnVsbCIgc2VydmVySG9zdElQPSJpZW8yd2x6c29hdDAyLzEwLjE0Mi40&#13;
LjExL3NvYV9zZXJ2ZXIyIiBhcHBsaWNhdGlvbklEPSJ1c3NkIiBwcm92aWRlcklEPSJvMmllIiBv&#13;
cmlnaW5hdG9ySVA9IjYyLjQwLjM4LjQxIiBTT0FDb25zdW1lclRyYW5zYWN0aW9uSUQ9IiIgU09B&#13;
VHJhbnNhY3Rpb25JRD0iNmI4YTZiMDctMWViMC00NDI0LTliYjktZWE0N2ZhNGNiNzMzIj48L2w6&#13;
ZXZlbnQ+DQo8bDpldmVudCBkYXRlVGltZT0iMjAxNS0wOS0wMyAwNjoyMzoyNi44NjQiIGxheWVy&#13;
TmFtZT0iT1NCIiBwcm9jZXNzTmFtZT0iTWFuYWdlQWRkT25fMV8wLmdldEN1cnJlbnRBZGRPbnNV&#13;
c2FnZV8xIiBldmVudFR5cGU9IkVORCIgZXZlbnRTdGF0dXM9IlNVQ0NFU1MiIGV2ZW50Q29kZT0i&#13;
IiBvdXRib3VuZFNlcnZpY2VOYW1lPSIiIHNlcnZlckhvc3RJUD0iaWVvMndsenNvYXQwMi8xMC4x&#13;
NDIuNC4xMS9zb2Ffc2VydmVyMiIgYXBwbGljYXRpb25JRD0idXNzZCIgcHJvdmlkZXJJRD0ibzJp&#13;
ZSIgb3JpZ2luYXRvcklQPSI2Mi40MC4zOC40MSIgU09BQ29uc3VtZXJUcmFuc2FjdGlvbklEPSIi&#13;
IFNPQVRyYW5zYWN0aW9uSUQ9IjZiOGE2YjA3LTFlYjAtNDQyNC05YmI5LWVhNDdmYTRjYjczMyI+&#13;
PG1hbjpnZXRDdXJyZW50QWRkT25zVXNhZ2VfMVJlc3BvbnNlIHhtbG5zOnNvYXBlbnY9Imh0dHA6&#13;
Ly9zY2hlbWFzLnhtbHNvYXAub3JnL3NvYXAvZW52ZWxvcGUvIiB4bWxuczp4c2Q9Imh0dHA6Ly93&#13;
d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIw&#13;
MDEvWE1MU2NoZW1hLWluc3RhbmNlIiB4bWxuczptYW49Imh0dHA6Ly9zb2EubzIuaWUvbWFuYWdl&#13;
YWRkb25kYXRhXzFfMCI+PG1hbjpyZXN1bHQ+PGNvcjpzdGF0dXNDb2RlIHhtbG5zOmNvcj0iaHR0&#13;
cDovL3NvYS5vMi5pZS9jb3JlZGF0YV8xXzAiPm1hbmFnZWFkZG9uLTMtMDAwOC1TPC9jb3I6c3Rh&#13;
dHVzQ29kZT48Y29yOmV4dGVybmFsRGVzY3JpcHRpb24geG1sbnM6Y29yPSJodHRwOi8vc29hLm8y&#13;
LmllL2NvcmVkYXRhXzFfMCI+UmVxdWVzdCBwcm9jZXNzZWQgc3VjY2Vzc2Z1bGx5LjwvY29yOmV4&#13;
dGVybmFsRGVzY3JpcHRpb24+PGNvcjppbnRlcm5hbERlc2NyaXB0aW9uIHhtbG5zOmNvcj0iaHR0&#13;
cDovL3NvYS5vMi5pZS9jb3JlZGF0YV8xXzAiPlJlcXVlc3QgcHJvY2Vzc2VkIHN1Y2Nlc3NmdWxs&#13;
eS48L2NvcjppbnRlcm5hbERlc2NyaXB0aW9uPjwvbWFuOnJlc3VsdD48bWFuOm1zaXNkbj4zNTM4&#13;
Njc4Nzc3MjY8L21hbjptc2lzZG4+PG1hbjphZGRPbnNVc2FnZT48bWFuOmFkZG9uVXNhZ2VEZXRh&#13;
aWxzPjxtYW46YWRkT25Db2RlPjUzMDwvbWFuOmFkZE9uQ29kZT48bWFuOmFkZE9uRGVzY3JpcHRp&#13;
b24+NTAwTUIgMzAgRGF5IFJlY3VyIEFkZCBPbjwvbWFuOmFkZE9uRGVzY3JpcHRpb24+PG1hbjph&#13;
ZGRPblNob3J0RGVzY3JpcHRpb24+NTAwTUIgUmVjdXI8L21hbjphZGRPblNob3J0RGVzY3JpcHRp&#13;
b24+PG1hbjphZGRPbkxvbmdEZXNjcmlwdGlvbj41MDBNQiAzMCBEYXkgUmVjdXJyaW5nIEFkZCBP&#13;
bjwvbWFuOmFkZE9uTG9uZ0Rlc2NyaXB0aW9uPjxtYW46YWRkT25DYXRlZ29yeT5EQVRBPC9tYW46&#13;
YWRkT25DYXRlZ29yeT48bWFuOmFkZE9uU3ViQ2F0ZWdvcnk+RE9NTUlEQVRBPC9tYW46YWRkT25T&#13;
dWJDYXRlZ29yeT48bWFuOm9jY3VyYW5jZVR5cGU+UkVDVVJSSU5HPC9tYW46b2NjdXJhbmNlVHlw&#13;
ZT48bWFuOnJlbWFpbmluZ0JhbGFuY2U+NTI0Mjg4MDAwPC9tYW46cmVtYWluaW5nQmFsYW5jZT48&#13;
bWFuOnB1cmNoYXNlVHlwZT5QYWlkPC9tYW46cHVyY2hhc2VUeXBlPjxtYW46ZXhwaXJhdGlvbkRh&#13;
dGU+LS08L21hbjpleHBpcmF0aW9uRGF0ZT48bWFuOmlzUHJvbW90aW9uYWxBZGRPbj5mYWxzZTwv&#13;
bWFuOmlzUHJvbW90aW9uYWxBZGRPbj48L21hbjphZGRvblVzYWdlRGV0YWlscz48bWFuOmFkZG9u&#13;
VXNhZ2VEZXRhaWxzPjxtYW46YWRkT25Db2RlPjQzMDwvbWFuOmFkZE9uQ29kZT48bWFuOmFkZE9u&#13;
RGVzY3JpcHRpb24+NTAwTUIgMzAgRGF5IE9uY2UgT2ZmIEFkZCBPbjwvbWFuOmFkZE9uRGVzY3Jp&#13;
cHRpb24+PG1hbjphZGRPblNob3J0RGVzY3JpcHRpb24+NTAwTUIgT25jZSBPZmY8L21hbjphZGRP&#13;
blNob3J0RGVzY3JpcHRpb24+PG1hbjphZGRPbkxvbmdEZXNjcmlwdGlvbj41MDBNQiAzMCBEYXkg&#13;
T25jZSBPZmYgQWRkIE9uPC9tYW46YWRkT25Mb25nRGVzY3JpcHRpb24+PG1hbjphZGRPbkNhdGVn&#13;
b3J5PkRBVEE8L21hbjphZGRPbkNhdGVnb3J5PjxtYW46YWRkT25TdWJDYXRlZ29yeT5ET01NSURB&#13;
VEE8L21hbjphZGRPblN1YkNhdGVnb3J5PjxtYW46b2NjdXJhbmNlVHlwZT5PTkNFT0ZGPC9tYW46&#13;
b2NjdXJhbmNlVHlwZT48bWFuOnJlbWFpbmluZ0JhbGFuY2U+NTI0Mjg4MDAwPC9tYW46cmVtYWlu&#13;
aW5nQmFsYW5jZT48bWFuOnB1cmNoYXNlVHlwZT5QYWlkPC9tYW46cHVyY2hhc2VUeXBlPjxtYW46&#13;
ZXhwaXJhdGlvbkRhdGU+MjAxNS0xMC0wNDwvbWFuOmV4cGlyYXRpb25EYXRlPjxtYW46aXNQcm9t&#13;
b3Rpb25hbEFkZE9uPmZhbHNlPC9tYW46aXNQcm9tb3Rpb25hbEFkZE9uPjwvbWFuOmFkZG9uVXNh&#13;
Z2VEZXRhaWxzPjwvbWFuOmFkZE9uc1VzYWdlPjwvbWFuOmdldEN1cnJlbnRBZGRPbnNVc2FnZV8x&#13;
UmVzcG9uc2U+PC9sOmV2ZW50Pg0K&#13;
</dp:set-file>
    </dp:request>
  </soapenv:Body>
</soapenv:Envelope>